## Production: api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 12 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                              |
|--------|----------------------------------------------------------------|
| add    | `module.api_ecs.aws_appautoscaling_policy.this[&quot;cpu&quot;]`         |
|        | `module.api_ecs.aws_appautoscaling_policy.this[&quot;memory&quot;]`      |
|        | `module.api_ecs.aws_appautoscaling_target.this[0]`             |
|        | `module.api_ecs.aws_cloudwatch_log_group.this`                 |
|        | `module.api_ecs.aws_ecs_service.this`                          |
|        | `module.api_ecs.aws_ecs_task_definition.this`                  |
|        | `module.api_ecs.aws_iam_policy.this_task[0]`                   |
|        | `module.api_ecs.aws_iam_policy.this_task_exec`                 |
|        | `module.api_ecs.aws_iam_role.this_task`                        |
|        | `module.api_ecs.aws_iam_role.this_task_exec`                   |
|        | `module.api_ecs.aws_iam_role_policy_attachment.this_task[0]`   |
|        | `module.api_ecs.aws_iam_role_policy_attachment.this_task_exec` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.api_ecs.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchGetImage",
                              + "ecr:BatchCheckLayerAvailability",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "secretsmanager:GetSecretValue"
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:secretsmanager:ca-central-1:957818836222:secret:zitadel_application_key-RK0KZF",
                              + "arn:aws:secretsmanager:ca-central-1:957818836222:secret:freshdesk_api_key-2Q118n",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
        ]
    }

  # module.api_ecs.data.aws_iam_policy_document.this_task_exec_logs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:DescribeLogGroups",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.api_ecs.aws_appautoscaling_policy.this["cpu"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/Forms/forms-api"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 60
          + scale_out_cooldown = 60
          + target_value       = 60

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.api_ecs.aws_appautoscaling_policy.this["memory"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/Forms/forms-api"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 60
          + scale_out_cooldown = 60
          + target_value       = 60

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.api_ecs.aws_appautoscaling_target.this[0] will be created
  + resource "aws_appautoscaling_target" "this" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 3
      + min_capacity       = 1
      + resource_id        = "service/Forms/forms-api"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags               = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all           = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # module.api_ecs.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/Forms/forms-api"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # module.api_ecs.aws_ecs_service.this will be created
  + resource "aws_ecs_service" "this" {
      + cluster                            = "Forms"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 60
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "forms-api"
      + platform_version                   = "LATEST"
      + propagate_tags                     = "SERVICE"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + task_definition                    = "forms-api"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_controller {
          + type = "ECS"
        }

      + load_balancer {
          + container_name   = "forms-api"
          + container_port   = 3001
            # (2 unchanged attributes hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + null,
            ]
          + subnets          = [
              + "subnet-025adc92b0ee815ba",
              + "subnet-05b9cd59ad60e88af",
              + "subnet-066cf27132a20a02a",
            ]
        }
    }

  # module.api_ecs.aws_ecs_task_definition.this will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "1024"
      + execution_role_arn       = (known after apply)
      + family                   = "forms-api"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # module.api_ecs.aws_iam_policy.this_task[0] will be created
  + resource "aws_iam_policy" "this_task" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "forms-api_ecs_task_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:GenerateDataKey",
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kms:ca-central-1:957818836222:key/afbaea67-8277-4a4c-853e-7697dd2dade5"
                      + Sid      = "KMSVault"
                    },
                  + {
                      + Action   = [
                          + "dynamodb:UpdateItem",
                          + "dynamodb:Query",
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:BatchWriteItem",
                          + "dynamodb:BatchGetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:ca-central-1:957818836222:table/Vault/index/*",
                          + "arn:aws:dynamodb:ca-central-1:957818836222:table/Vault",
                        ]
                      + Sid      = "DynamoDBVault"
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:GetObjectVersionTagging",
                          + "s3:GetObjectVersion",
                          + "s3:GetObjectTagging",
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::forms-production-vault-file-storage/*",
                          + "arn:aws:s3:::forms-production-vault-file-storage",
                        ]
                      + Sid      = "S3Vault"
                    },
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:server-database-url-jVtWGE"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # module.api_ecs.aws_iam_policy.this_task_exec will be created
  + resource "aws_iam_policy" "this_task_exec" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "forms-api_ecs_task_exec_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # module.api_ecs.aws_iam_role.this_task will be created
  + resource "aws_iam_role" "this_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "forms-api_ecs_task_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.api_ecs.aws_iam_role.this_task_exec will be created
  + resource "aws_iam_role" "this_task_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "forms-api_ecs_task_exec_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.api_ecs.aws_iam_role_policy_attachment.this_task[0] will be created
  + resource "aws_iam_role_policy_attachment" "this_task" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "forms-api_ecs_task_role"
    }

  # module.api_ecs.aws_iam_role_policy_attachment.this_task_exec will be created
  + resource "aws_iam_role_policy_attachment" "this_task_exec" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "forms-api_ecs_task_exec_role"
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ecs_api_cloudwatch_log_group_name = "/aws/ecs/Forms/forms-api"
  + ecs_api_cluster_name              = "Forms"
  + ecs_api_service_name              = "forms-api"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
